labwork11/src/Documents/ЗакупкаЭлектросамокатов/ЗакупкаЭлектросамокатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакупкаЭлектросамокатов</name>
  <registerRecords>AccumulationRegister.ОстаткиЭлектросамокатов</registerRecords>
  <attributes>
    <name>Электросамокат</name>
    <type>
      <types>CatalogRef.Электросамокаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

labwork11/src/AccumulationRegisters/ОстаткиЭлектросамокатов/ОстаткиЭлектросамокатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиЭлектросамокатов</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Электросамокат</name>
    <type>
      <types>CatalogRef.Электросамокаты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

labwork11/src/Documents/ЗакупкаЭлектросамокатов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр ОстаткиЭлектросамокатов
	Движения.ОстаткиЭлектросамокатов.Записывать = Истина;
	Движение = Движения.ОстаткиЭлектросамокатов.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Электросамокат = Электросамокат;
	Движение.Количество = Количество;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
